test_cases/OAT15_DDES/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync   false;

patches
(

    {
        // Name of new patch
        name airfoil;

        // Dictionary to construct new patch from
        patchInfo
        {
            type    wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches ("airfoil");
    }
    {
        // Name of new patch
        name Front;

        // Type of new patch
        patchInfo
        {
            type cyclic;
            neighbourPatch Back;
        }
    
        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (front);
    }
    {
        // Name of new patch
        name Back;

        // Type of new patch
        patchInfo
        {
            type cyclic;
            neighbourPatch Front;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (back);
    }
 {
        // Name of new patch
        name outerBoundary;

        // Type of new patch
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches ("domain");
    }



);


// ************************************************************************* //
